- Merge
- groupby()
- Crosstab
- pivot
- pivot_table
- datetime module
- Aggregate Function

## Merge

The merge() function in Pandas combines two or more DataFrames by matching rows based on specified columns, allowing you to create a single unified dataset.

- inner
- left
- right
- outer

### syntax

pd.merge(dataframe1,dataframe2,on='column_name',how='merging_method')

### example

In [51]:
a1=pd.DataFrame({'Name':['komal','kartik','priya'],'ID':[101,102,103],'Cities':['Bhandara','nagpur','pune']})

a1

     Name   ID    Cities
0   komal  101  Bhandara
1  kartik  102    nagpur
2   priya  103      pune

In [52]:

a2=pd.DataFrame({'Name':['nidhi','poonam','nikita'],'ID':[101,105,103],'Cities':['pune','hyd','mumbai']})

a2

     Name   ID  Cities
0   nidhi  101    pune
1  poonam  105     hyd
2  nikita  103  mumbai

## inner

#### inner merge only show matching records from both the dataframe.

In [54]:
d3=pd.merge(a1,a2,on='ID',how='inner')## Merging two DataFrames 'a1' and 'a2' based on the 'ID' column using an inner join.

d3                                  # return matching records from both the datasets

  Name_x   ID  Cities_x  Name_y Cities_y
0  komal  101  Bhandara   nidhi     pune
1  priya  103      pune  nikita   mumbai

### left

display full records from left dataframe and only matching records from right dataframe

#### example

In [41]:
d4=pd.merge(a1,a2,on='ID',how='left')

d4

   Name_x   ID  Cities_x  Name_y Cities_y
0   komal  101  Bhandara   nidhi     pune
1  kartik  102    nagpur     NaN      NaN
2   priya  103      pune  nikita   mumbai

### right

In [ ]:
display full records from right dataframe and only matching records from left dataframe

In [55]:
d5=pd.merge(a1,a2,on='ID',how='right')

d5

  Name_x   ID  Cities_x  Name_y Cities_y
0  komal  101  Bhandara   nidhi     pune
1    NaN  105       NaN  poonam      hyd
2  priya  103      pune  nikita   mumbai

### outer

#### display full record from both the dataframes

In [56]:
d4=pd.merge(a1,a2,on='ID',how='outer')

d4

   Name_x   ID  Cities_x  Name_y Cities_y
0   komal  101  Bhandara   nidhi     pune
1  kartik  102    nagpur     NaN      NaN
2   priya  103      pune  nikita   mumbai
3     NaN  105       NaN  poonam      hyd

In [1]:
###########################################################33

## groupby()

The groupby is one of the most frequently used Pandas functions in data analysis. It is used for grouping the data points (i.e. rows) based on the distinct values in the given column or columns. We can then calculate aggregated values for the generated groups.

In [2]:
#example

# g=df1.groupby('gender')

# g.get_group('M')

# g1.get_group('F')['salary']

# g.get_group('M')['salary'].mean()



# g2 = df1.groupby(['gender','city'])

# g2.get_group(('M','pune'))['salary']

In [42]:
df1 =pd.read_csv(r"Employee.csv")

df1

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

#### example

In [43]:
g=df1.groupby('gender')         # Grouping the DataFrame 'df1' by the 'gender' column.

g

In [45]:
g.groups      # Accessing the groups created by the 'groupby' operation and displaying them.

{'F': [1, 4, 6, 7, 8, 9, 11, 12], 'M': [0, 2, 3, 5, 10, 13, 14]}

In [46]:
g.get_group('M')

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
5   1006      M  bhandara           5  50000.0
10  1011      M    nagpur           9  90000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [47]:
g.get_group('F')

      Id gender      city  experience   salary
1   1002      F    mumbai           5  50000.0
4   1005      F      beed           7  70000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0

In [48]:
# example3

g.get_group('F')['salary']

1     50000.0
4     70000.0
6     20000.0
7     80000.0
8     60000.0
9     30000.0
11    40000.0
12    10000.0
Name: salary, dtype: float64

In [49]:
# example4

#mean--->avg

g.get_group('F')['salary'].mean()

45000.0

In [ ]:
g.get_group('F')['salary'].mean()

- min
- max
- sum
- mean

In [50]:
g2 = df1.groupby(['gender','city'])

g2

In [51]:
g2.groups

{('F', 'beed'): [4, 6], ('F', 'bhandara'): [12], ('F', 'gondia'): [11], ('F', 'mumbai'): [1], ('F', 'nagpur'): [8], ('F', 'pune'): [7, 9], ('M', 'beed'): [3], ('M', 'bhandara'): [5], ('M', 'gondia'): [13], ('M', 'nagpur'): [10, 14], ('M', 'pune'): [0, 2]}

In [53]:
df1

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [54]:
g2.get_group(('M','pune'))['salary']

0    10000.0
2        NaN
Name: salary, dtype: float64

In [ ]:
#############################################

### Crosstab

#### cross tabulation

The Crosstab function in Pandas is a method for restructuring and summarizing data, particularly useful for analyzing relationships between categorical variables.

In [55]:
import pandas as pd

df2 = pd.read_excel(r'C:\Users\Acer\Downloads\survey.xls')

df2

      Name Nationality  Gender  Age Handedness
0    Kathy         USA  Female   23      Right
1    Linda         USA  Female   18      Right
2    Peter         USA    Male   19      Right
3     John         USA    Male   22       Left
4   Fatima   Bangadesh  Female   31       Left
5    Kadir   Bangadesh    Male   25       Left
6   Dhaval       India    Male   35       Left
7   Sudhir       India    Male   31       Left
8   Parvir       India  Female   37      Right
9      Yan       China  Female   52      Right
10    Juan       China  Female   58       Left
11   Liang       China    Male   43       Left

#### syntax

In [ ]:
pd.crosstab(index,column)

#### example1

In [56]:
pd.crosstab(df2.Nationality,df2.Handedness)

Handedness   Left  Right
Nationality
Bangadesh       2      0
China           2      1
India           2      1
USA             1      3

#### example2

In [57]:
pd.crosstab(df2.Gender,df2.Handedness)

Handedness  Left  Right
Gender
Female         2      4
Male           5      1

#### example3

In [58]:
pd.crosstab([df2.Nationality,df2.Gender],[df2.Handedness])

Handedness          Left  Right
Nationality Gender
Bangadesh   Female     1      0
            Male       1      0
China       Female     1      1
            Male       1      0
India       Female     0      1
            Male       2      0
USA         Female     0      2
            Male       1      1

### margins

In [61]:
# example


pd.crosstab([df2.Nationality,df2.Gender],[df2.Handedness],margins=True,margins_name='Total')

Handedness          Left  Right  Total
Nationality Gender
Bangadesh   Female     1      0      1
            Male       1      0      1
China       Female     1      1      2
            Male       1      0      1
India       Female     0      1      1
            Male       2      0      2
USA         Female     0      2      2
            Male       1      1      2
Total                  7      5     12

In [60]:
pd.crosstab(df2.Gender,df2.Handedness,margins=True,margins_name='Sum')

Handedness  Left  Right  Sum
Gender
Female         2      4    6
Male           5      1    6
Sum            7      5   12

### multi index,columns

In [ ]:
# pd.crosstab([df2.Nationality,df2.Gender],[df2.Handedness],margins=True,margins_name='Sum')

In [62]:
##########################################################################

## pivot

- Reshape data
- duplication not allowed
- To summarized the data

In [4]:
import pandas as pd

df3 =pd.read_csv(r"Employee.csv")

df3

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

#### syntax

dataframe_name.pivot(index='column_name',columns='columns_name')

#### example

In [7]:
df3.pivot(index='Id',columns='city',values='salary')

city     beed  bhandara   gondia   mumbai   nagpur     pune
Id
1001      NaN       NaN      NaN      NaN      NaN  10000.0
1002      NaN       NaN      NaN  50000.0      NaN      NaN
1003      NaN       NaN      NaN      NaN      NaN      NaN
1004  60000.0       NaN      NaN      NaN      NaN      NaN
1005  70000.0       NaN      NaN      NaN      NaN      NaN
1006      NaN   50000.0      NaN      NaN      NaN      NaN
1007  20000.0       NaN      NaN      NaN      NaN      NaN
1008      NaN       NaN      NaN      NaN      NaN  80000.0
1009      NaN       NaN      NaN      NaN  60000.0      NaN
1010      NaN       NaN      NaN      NaN      NaN  30000.0
1011      NaN       NaN      NaN      NaN  90000.0      NaN
1012      NaN       NaN  40000.0      NaN      NaN      NaN
1013      NaN   10000.0      NaN      NaN      NaN      NaN
1014      NaN       NaN  80000.0      NaN      NaN      NaN
1015      NaN       NaN      NaN      NaN  50000.0      NaN

In [9]:
# example2

# df3.pivot(index='Id',columns='city',values='salary')

city     beed  bhandara   gondia   mumbai   nagpur     pune
Id
1001      NaN       NaN      NaN      NaN      NaN  10000.0
1002      NaN       NaN      NaN  50000.0      NaN      NaN
1003      NaN       NaN      NaN      NaN      NaN      NaN
1004  60000.0       NaN      NaN      NaN      NaN      NaN
1005  70000.0       NaN      NaN      NaN      NaN      NaN
1006      NaN   50000.0      NaN      NaN      NaN      NaN
1007  20000.0       NaN      NaN      NaN      NaN      NaN
1008      NaN       NaN      NaN      NaN      NaN  80000.0
1009      NaN       NaN      NaN      NaN  60000.0      NaN
1010      NaN       NaN      NaN      NaN      NaN  30000.0
1011      NaN       NaN      NaN      NaN  90000.0      NaN
1012      NaN       NaN  40000.0      NaN      NaN      NaN
1013      NaN   10000.0      NaN      NaN      NaN      NaN
1014      NaN       NaN  80000.0      NaN      NaN      NaN
1015      NaN       NaN      NaN      NaN  50000.0      NaN

In [10]:
# # example3


df3.pivot(index='gender',columns='Id',values='salary')

Id,1001,1002,1003,1004,1005,1006,1007,1008,1009,1010,1011,1012,1013,1014,1015
gender,,,,,,,,,,,,,,,
F,NaN,50000.0,NaN,NaN,70000.0,NaN,20000.0,80000.0,60000.0,30000.0,NaN,40000.0,10000.0,NaN,NaN
M,10000.0,NaN,NaN,60000.0,NaN,50000.0,NaN,NaN,NaN,NaN,90000.0,NaN,NaN,80000.0,50000.0

In [13]:
#duplication  not allowed

df3.pivot(index='gender',columns='city',values='salary')

ValueError: Index contains duplicate entries, cannot reshape

### pivot_table

- duplication allowed
- use for reshaping data

In [14]:
df3.pivot_table(index='gender',columns='city',values='salary')  # duplication allowed

city       beed  bhandara   gondia   mumbai   nagpur     pune
gender
F       45000.0   10000.0  40000.0  50000.0  60000.0  55000.0
M       60000.0   50000.0  80000.0      NaN  70000.0  10000.0

In [17]:
#example1

df3.pivot_table(index='gender',columns='city',values='salary',fill_value=0)

city     beed  bhandara  gondia  mumbai  nagpur   pune
gender
F       45000     10000   40000   50000   60000  55000
M       60000     50000   80000       0   70000  10000

In [19]:
df3

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

In [18]:
# example2

df3.pivot_table(index='gender',columns='city',values='salary',aggfunc='max')

city       beed  bhandara   gondia   mumbai   nagpur     pune
gender
F       70000.0   10000.0  40000.0  50000.0  60000.0  80000.0
M       60000.0   50000.0  80000.0      NaN  90000.0  10000.0

## datetime module

In [20]:
import datetime

#### examples

In [21]:
datetime.datetime.now()

datetime.datetime(2023, 9, 5, 15, 48, 31, 705732)

In [22]:
datetime.datetime.today()

datetime.datetime(2023, 9, 5, 15, 49, 20, 336889)

In [23]:
current_date = datetime.datetime.now()

In [24]:
current_date

datetime.datetime(2023, 9, 5, 17, 20, 25, 505388)

In [25]:
current_date.year

2023

In [26]:
current_date.month

9

In [27]:
current_date.day

5

In [28]:
current_date.hour

17

In [29]:
current_date.minute

20

In [30]:
current_date.second

25

In [31]:
current_date.microsecond

505388

In [32]:
print(current_date.day,'/',current_date.month,'/',current_date.year)

5 / 9 / 2023

In [33]:
print(current_date.day,'-',current_date.month,'-',current_date.year  )

5 - 9 - 2023

### strftime

#### string formatting time

%a Weekday, short version
%A Weekday, full version
%w Weekday as a number 0-6, 0 is Sunday
%d Day of month 01-31
%b Month name, short version
%B Month name, full version
%m Month as a number
%y Year, short version, without century
%Y Year, full version

In [ ]:
# current_date.strftime('%A')

# print(current_date.strftime('%d %B %Y'))

In [34]:
current_date.strftime('%a')

'Tue'

In [35]:
current_date.strftime('%A')

'Tuesday'

In [36]:
current_date.strftime('%w')

'2'

In [37]:
current_date.strftime('%d')

'05'

In [38]:
current_date.strftime('%D')

'09/05/23'

#### Months name

In [39]:
current_date.strftime('%b')

'Sep'

In [40]:
current_date.strftime('%B')

'September'

#### Month as a number

In [41]:
current_date.strftime('%m')

'09'

#### year

In [42]:
current_date.strftime('%y')

'23'

In [43]:
current_date.strftime('%Y')

'2023'

### isoweekday

mon=1
tue=2
sunday=7

In [45]:
current_date.isoweekday()

2

### weekday()

In [12]:
mon=0
sun=6

In [48]:
current_date.weekday()

1

### date_range()

In [49]:
import pandas as pd


f=pd.date_range('2023',periods=10)

f

DatetimeIndex(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04',
               '2023-01-05', '2023-01-06', '2023-01-07', '2023-01-08',
               '2023-01-09', '2023-01-10'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df3

      Id gender      city  experience   salary
0   1001      M      pune           1  10000.0
1   1002      F    mumbai           5  50000.0
2   1003      M      pune           4      NaN
3   1004      M      beed           6  60000.0
4   1005      F      beed           7  70000.0
5   1006      M  bhandara           5  50000.0
6   1007      F      beed           2  20000.0
7   1008      F      pune           8  80000.0
8   1009      F    nagpur           6  60000.0
9   1010      F      pune           3  30000.0
10  1011      M    nagpur           9  90000.0
11  1012      F    gondia           4  40000.0
12  1013      F  bhandara           1  10000.0
13  1014      M    gondia           8  80000.0
14  1015      M    nagpur           5  50000.0

### Aggregate Function

- sum
- mean
- std
- var
- min
- max

In [6]:
z2=df3.agg(['max','min','sum','std','var'])
z2

C:\Users\Acer\AppData\Local\Temp\ipykernel_11384\116822281.py:1: FutureWarning: ['gender', 'city'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  z2=df3.agg(['max','min','sum','std','var'])

,Id,gender,city,experience,salary
max,1015.000000,M,pune,9.000000,9.000000e+04
min,1001.000000,F,beed,1.000000,1.000000e+04
sum,15120.000000,MFMMFMFFFFMFFMM,punemumbaipunebeedbeedbhandarabeedpunenagpurpu...,74.000000,7.000000e+05
std,4.472136,NaN,NaN,2.491892,2.572039e+04
var,20.000000,NaN,NaN,6.209524,6.615385e+08

In [10]:
z1=df2.agg(min)

z1

sub1    35
sub2    45
sub3    45
sub4    54
sub5    45
sub6    46
dtype: int64

In [7]:
df2 =pd.read_csv(r"data.csv")

df2

   sub1  sub2  sub3  sub4  sub5  sub6
0    50    54    45    65    60    78
1    63    74    54    54    47    50
2    41    58    65    54    45    46
3    78    69    56    65    63    64
4    96    45    60    78    52    52
5    96    45    60    78    52    52
6    35    55    66    77    52    50
7    65    66    45    58    63    63
8    35    55    66    77    52    50

In [8]:
df2.agg(['max','min','sum','std','var'])

           sub1        sub2        sub3        sub4        sub5        sub6
max   96.000000   74.000000   66.000000   78.000000   63.000000   78.000000
min   35.000000   45.000000   45.000000   54.000000   45.000000   46.000000
sum  559.000000  521.000000  517.000000  606.000000  486.000000  505.000000
std   24.033541   10.080234    8.217529   10.416333    6.557439   10.227957
var  577.611111  101.611111   67.527778  108.500000   43.000000  104.611111

In [11]:
df2

   sub1  sub2  sub3  sub4  sub5  sub6
0    50    54    45    65    60    78
1    63    74    54    54    47    50
2    41    58    65    54    45    46
3    78    69    56    65    63    64
4    96    45    60    78    52    52
5    96    45    60    78    52    52
6    35    55    66    77    52    50
7    65    66    45    58    63    63
8    35    55    66    77    52    50

In [13]:
df2["sub7"]=[12,23,23,45,56,67,78,67,78]

In [14]:
df2

   sub1  sub2  sub3  sub4  sub5  sub6  sub7
0    50    54    45    65    60    78    12
1    63    74    54    54    47    50    23
2    41    58    65    54    45    46    23
3    78    69    56    65    63    64    45
4    96    45    60    78    52    52    56
5    96    45    60    78    52    52    67
6    35    55    66    77    52    50    78
7    65    66    45    58    63    63    67
8    35    55    66    77    52    50    78